blog-posts/2013-03-13-learn-emacs-lisp-by-reading-emacs-lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Learn Emacs Lisp by reading Emacs Lisp</title>
<!-- 2015-01-07 Wed 14:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Learn Emacs Lisp by reading Emacs Lisp</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Where to find code</a></li>
<li><a href="#sec-2">How to understand code</a></li>
<li><a href="#sec-3">How to step through code</a></li>
<li><a href="#sec-4">How to make code your own</a></li>
</ul>
</div>
</div>
<p>
March 13th, 2013 -
<a href="http://sachachua.com/blog/p/24534"><a href="http://sachachua.com/blog/p/24534">http://sachachua.com/blog/p/24534</a></a>
</p>

<p>
Learning Emacs Lisp can help you really tweak your Emacs environment to
fit you, saving time, smoothening out frustrations, and making things
easier. Reading code is an essential part of learning how to code. By
reading other people's code, you'll not only discover interesting syntax
and library features, but you'll also start absorbing the idioms &#x2013; the
ways of doing things. (This is why it's important to read good,
well-formatted code.)
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Where to find code</h2>
<div class="outline-text-2" id="text-1">
<p>
You can use <code>C-h k</code> (<code>describe-key</code>) to explore the code behind
keystrokes, menu items, and mouse actions. If the source code is
installed, you should see a hyperlink in the information window that
appears. It's a good idea to install the Emacs Lisp source code for
Emacs.
</p>

<p>
If you know the name of the function you're interested in, <code>C-h f</code>
(<code>describe-function</code>) will link to the source code and describe the
function.
</p>

<p>
You can find lots of other Emacs code snippets on
<a href="http://emacswiki.org"><a href="http://emacswiki.org">http://emacswiki.org</a></a> and in blog posts on
<a href="http://planet.emacsen.org"><a href="http://planet.emacsen.org">http://planet.emacsen.org</a></a> .
<a href="http://news.gmane.org/gmane.emacs.sources/">gnu.emacs.sources</a> and
other Emacs-related newsgroups or mailing lists are useful, too.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">How to understand code</h2>
<div class="outline-text-2" id="text-2">
<p>
At first glance, Emacs Lisp looks like a mess of parentheses and strange
incantations. <code>setq</code>? <code>defun</code>? <code>cdar</code>?
</p>

<p>
This is true at second glance, too.
</p>

<p>
Read through the
<a href="http://www.gnu.org/software/emacs/emacs-lisp-intro/html_mono/emacs-lisp-intro.html">Emacs
Lisp intro manual</a> either online or in Emacs (C-h i m Emacs Lisp
Intro). You'll probably understand very little the first few times
through. This is okay. All you need to do is get a vague idea of what
things are called so that you can look them up when you need to.
</p>

<p>
Now read your code again. Slightly of it should make sense.
</p>

<p>
Skim the <a href="http://www.emacswiki.org/emacs/EmacsLispReference">Emacs Lisp
manual</a>, too. This is a reference, so you'll understand even less of it
as an Emacs Lisp newbie, but it's good for picking up terms.
</p>

<p>
You don't need to understand all of Emacs Lisp in order to take
advantage of other people's configuration snippets. You'll learn things
along the way.
</p>

<p>
Make liberal use of <code>C-h f</code> to describe functions and <code>C-h v</code>
(<code>describe-variable</code>) to investigate. You can jump to function
definitions with <code>find-function</code>, which is worth binding to a keystroke.
For example, to map F8 to <code>find-function</code> temporarily, use
<code>M-x global-set-key RET F8 find-function</code>.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">How to step through code</h2>
<div class="outline-text-2" id="text-3">
<p>
Edebug is an interactive debugger for Emacs so that you can step through
the code instead of guessing what the code will do.
(<a href="http://www.gnu.org/software/emacs/manual/html_node/elisp/Using-Edebug.html">Edebug
documentation</a>) Use <code>M-x edebug-defun</code> to prepare the function you're
interested in, then run the function. Press <code>SPC</code> to step through the
code, <code>e</code> to evaluate expressions (you can use this to find the values
of numbers), <code>h</code> to continue until the specified point, <code>b</code> to set a
breakpont, <code>g</code> to execute until a breakpoint, and <code>q</code> to stop debugging.
</p>

<p>
Super awesome.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">How to make code your own</h2>
<div class="outline-text-2" id="text-4">
<p>
You can copy code to the <code>*scratch*</code> buffer or another file, tweak it a
little, evaluate or edebug the code, and see what changed. If you like
your changes, you can:
</p>

<ul class="org-ul">
<li>rename the function and add it to your configuration file,
</li>
<li>use
<a href="http://www.gnu.org/software/emacs/manual/html_node/elisp/Advising-Functions.html">advice</a>
to modify the existing function, or
</li>
<li>redefine the function (keeping the name as-is) and adding it to your
configuration file. (This can lead to weird behaviour, so do this
carefully!)
</li>
</ul>

<p>
Enjoy!
</p>

<p>
Other reading:
</p>

<p>
<a href="http://emacswiki.org/emacs/LearnEmacsLisp">EmacsWiki: Learn Emacs
Lisp</a>
</p>

<p>
<i>Thanks to bl3u for the nudge to write about this!</i>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
